/***************************************************************

  BayCom(R)   Packet-Radio fuer IBM PC

  OpenBayCom-Mailbox

  -------------------------------------------
  Definitionen und Deklarationen fuer Mailbox
  -------------------------------------------


  Copyright (c)       Florian Radlherr
                      Taubenbergstr. 32
                      D-83627 Warngau

  Alle Rechte vorbehalten / All Rights Reserved

 ***************************************************************/


//19980115 OE3DZW removed obsolete defines, changed fbb-fwd-path
//                added ad_timezone()
//19980124 OE3DZW added define for REJECTLOGNAME
//19980202 OE3DZW added option for new callcheck (from hrx), id for cb-mode
//19980208 OE3DZW defined BETREFFLEN
//19980211 OE3DZW added bytes/connects to fwdpara_t
//19980215 OE3DZW added define for syslog_r.bcm
//19980218 OE3DZW added msgty(pe) to mailflags
//19980301 OE3DZW added ax25_set_pid (mbflex.cpp)
//19980226 hrx    added taskwin to functions (interfac.cpp)
//19980301 OE3DZW added killforwarded, add_hold
//19980311 DG9MHZ changes for Linux-Kernel AX25
//19980324 DH3MB  support for md2/5
//19980408 hrx    cbmodeid changed (from /cb to cb)
//                autotrcwin added to mailpara_t
//                mbcheckcount added to functions, section check.cpp
//                trcwin added to functions, section interfac.cpp
//19980411 hrx    changed type of mbcheckcount() to long

  char     uplink[CALLSSID+1];          // 10 uplink-Digi
  char     readlock;                    //  1 Privatmails "nicht lesbar"
  char     pwline;                      //  1 Leerzeile beim Login
  char     echo;                        //  1 Eigene Eingaben zurueckschicken
  char     rlimit;                      //  1 fremde Privatmails nicht lesbar
  char     ufwd[40];                    // 40 Connect-Path fuer User-forwarding
  char     loginpwtype;                 //  1 Password-type for ax-login (DH3MB)
  char     sfpwtype;                    //  1 Password-type for S&F (DH3MB)
  char     newcall[CALLEN+1];           //  7 New callsign (lizence update)
  char     dirformat;                   //  1 Dir/Check/List in new format
  char     unsecure_smtp;               //  1  0=>needs to pop before smtp
                                        //     1=>smtp without pop allowed
  char     binmode;                     //  1 AutoBIN/YAPP/DIDADIT bei BIN-Mails
  char     ttycharset;                  //  1 A TTYCHARSET (nicht impl)
  char     mybbs[MYBBSLEN+1];           // 40 A FORWARD
  char     away;                        //  1 AWAY-Funktion aktiv (DH8YMB)
  char     restplatz[2];                //  2 ist noch frei (definiert 0)
  unsigned long filepos;                //  4 position within file
  unsigned long nextsamehash;           //  4 hash to next record
                                        // = 512 Bytes (473)
} userold_t;
#endif
#endif


/*---------------------------------------------------------------------------*/

typedef enum
{ j_idle,
  j_fwdlink,
  j_fwdsend,
  j_fwdsendf,
  j_fwdrecv,
  j_fwdrecvf,
  j_fbb_send_propose,
  j_fbb_send_mail,
  j_fbb_send_delay,
  j_fbb_recv_propose,
  j_fbb_recv_mail,
  j_fbb_end,
  j_fbb_error,
  j_send,
  j_read,
  j_cmd,
  j_search,
  j_purge,
  j_reorg,
  j_tell,
  j_node,
  j_ftrans,
  j_router,
  j_convers
} job_typ;

typedef int handle;


#define NOTASK (-1)
// Flags fuer laufenden Prozess (wird in t->processkind hinterlegt)
// Die Flags koennen beliebig kombiniert werden
//
#define P_MAIL 1      // hat einen Mailbox-Kontrollblock
#define P_WIND 2      // hat einen Editor-Kontrollblock
#define P_KEYB 4      // benutzt Tastatureingaben
#define P_BACK 8      // laeuft im Hintergrund (keinerlei Ein- und Ausgabe)
#define P_CLON 16     // DH3MB: Mailbox-Kontrollblock wird in die neue
                      // Task uebernommen
#define P_AX25K  0x100
#define P_TELNET 0x200


typedef unsigned long bitfeld;

/*---------------------------------------------------------------------------*/

typedef enum event_t
{ e_nothing,
  e_ticsfull,
  e_reschedule,
  e_delay,
  e_kbhit
} event_t;

/*---------------------------------------------------------------------------*/

typedef enum io_t
{ io_dummy,
  io_window,
  io_editwin,
  io_tnc,
  io_tty,
  io_file,
  io_socket,
  io_memory,
  io_comp // DH3MB: Online-COMP
} io_t;

/*---------------------------------------------------------------------------*/

#define MONBUFLEN 2048

typedef struct monbuf_t
{ int      tid;
  bitfeld  opt;
  unsigned in;
  unsigned out;
  int      congested;
  char     buf[MONBUFLEN];
} monbuf_t;

/*---------------------------------------------------------------------------*/

#ifdef _AX25K
/*
#define TXLEN 512
#define RXLEN 512
#define MAXSOCK 256

typedef struct sock_t
{
  char rxbuf[RXLEN];
  char txbuf[TXLEN];
  char mycall[16];
  int handle;
  int rxc;
  int txc;
  int rxlen;
  int wasput;
  int wasda;
  char dasda;
  time_t lastflush;
}
sock_t;

extern sock_t so[MAXSOCK];
extern int ax25k_ok ;
*/
#endif

/*---------------------------------------------------------------------------*/

typedef void (* atkill_t)(void);
typedef void (* atkill2_t)(void *);
#define MAX_ATKILL 4

/*---------------------------------------------------------------------------*/

typedef struct task_t
{ event_t  event;
  int      taskid;
  int      port;
  int      lock;                // >0 avoids re-scheduling
  int      socket;
  int      childpid;
  io_t     input;
  io_t     output;
  monbuf_t *monitor;
  unsigned lastdelay;
  unsigned begintic;
  long     cputics;
  jmp_buf  j;
  unsigned processkind;
  time_t   created;
  time_t   last_input;
  time_t   kill_time;
  time_t   warn_time;
  int      kill_warn;
  unsigned keybuffer[32];
  int      keybufin;
  int      keybufout;
  void     *e;
  void     *b;
  atkill2_t atkill[MAX_ATKILL];
  void     *atkill_p[MAX_ATKILL];
  unsigned atkillcnt;
  char     name[20];
  // the sequence of lastcmd, lastfunc and stack is important for the stack
  // overflow detection verify_stack(), don't change it! (db1ras)
  char     lastcmd[60];        // letztes eingegebenes Kommando
  char     lastfunc[40];       // letzte aufgerufene Funktion
  char     stack[TASKSTACK+4]; // Stack
  char     downlink[10];       // letztes Digirufzeichen
} task_t;

/*---------------------------------------------------------------------------*/

#define _s_report      0
#define _s_replog      1
#define _s_serious     2
#define _s_fatal       3
#define _s_tr_abbruch  4

#ifdef __FLAT__
#define report      _s_report, __LINE__, __FILE__
#define replog      _s_replog, __LINE__, __FILE__
#define serious     _s_serious, __LINE__, __FILE__
#define fatal       _s_fatal, __LINE__, __FILE__
#define tr_abbruch  _s_tr_abbruch, __LINE__, __FILE__
#else
#define report      _s_report, 0, ""
#define replog      _s_replog, 0, ""
#define serious     _s_serious, 0, ""
#define fatal       _s_fatal, 0, ""
#define tr_abbruch  _s_tr_abbruch, 0, ""
#endif

extern int newkeywin;
extern int keytaskid;
extern int deskkey;
extern int init_off;
extern task_t *t;       // Zeiger auf aktuellen TCB
extern long systic;

void call_l2 (int off);

/*---------------------------------------------------------------------------*/

#ifdef _WXSTN
// for wx-station
typedef struct
{ int data_valid;
  long
        dayoyear,
        minuteofday,
        wind_beaufort;
  double
        sat_sp,            // saturation steam pressure
        rainltt,           // rain long term total
        steam_pressure,
        wind_chill,
        windspeed,
        outdoort,
        snowfall_limit,
        air_pres_qnh,
        air_pres_qfe,
        abs_humidity,
        dew_point,
        kond_niveau,
        indoort,           // indoor temperature
        humidity,
        hum_indoor,        // humidity indoor
        wind_direction;    // 0..360 degrees
        char *winddir_str;
        time_t t;
} wxdata_t;
#endif

/*---------------------------------------------------------------------------*/

typedef enum option_index_t
//*************************************************************************
//
//  Index fuer das Feld mit den Optionen
//
//*************************************************************************
{ o_id=0,  // info-dir
  o_ud,    // user-dir
  o_il,    // info-list
  o_ul,    // user-list
  o_ir,    // info-read
  o_ur,    // user-read
  o_ch,    // check
  o_ps     // ps
} option_index_t;

/*---------------------------------------------------------------------------*/

typedef enum umlaut_t
{ um_none,   // keine Umlautwandlung
  um_ibm,    // IBM-Umlaute
  um_din,    // DIN-Umlaute (statt [\]{|}~)
  um_aeoeue, // Wandlung nach AE OE UE
  um_iso     // Wandlung nach ISO (Linux,Windows)
} umlaut_t;

/*---------------------------------------------------------------------------*/

typedef enum fwdtype_t
{ fwd_none,
  fwd_standard,
  fwd_user,
  fwd_file
} fwdtype_t;

/*---------------------------------------------------------------------------*/

typedef enum loginmode_t
{ login_silent,
  login_standard,
  login_ufwd,
  login_fwd,
  login_nofwd
} loginmode_t;

/*---------------------------------------------------------------------------*/

typedef struct bulletin_t
{ char name[MAXTREELENGTH];
  byte flatoffset; //offset of name w/o path
  short unsigned lifetime_min;
  short unsigned lifetime_max;
  //time_t created;
  time_t newestmail;
} bulletin_t;

/*---------------------------------------------------------------------------*/

#ifdef _TELEPHONE // JJ
typedef struct ttypara_t
{ int      comirq;
  int      comadr;
  char     cmdatz[60];
  char     cmdata[60];
  char     cmdatd[60];
  char     ringindicator[60];
  char     connectindicator[60];
  char     dialprefix[60];
  char     dialsuffix[60];
  int      ringtimeout;
  int      dialtimeout;
  int      dialdelay;
  int      connectdelay;
  int      maxcontime;
  int      maxcons;
  int      debug;
  int      ttytimeout;
} ttypara_t;
#endif

/*---------------------------------------------------------------------------*/

typedef struct reject_t //DF3VI
{ char action;                 // R, G, E, F, H, L, P, O
  char sender[LINELEN+1];      // <
  char destin[LINELEN+1];      // >
  char bid[LINELEN+1];         // $
  char at[LINELEN+1];          // @
  char type;                   // .
} reject_t;

/*---------------------------------------------------------------------------*/

#define MK_MYCALLS   8

typedef struct mailpara_t
{ char     boxname[CALLEN+1];
  char     boxadress[HADRESSLEN+1];
  char     boxheader[45];
#ifdef __FLAT__
  int      tcp_port;
  int      ftp_port;
  int      http_port;
  int      smtp_port;
  int      pop3_port;
  int      nntp_port;
  int      serv_port;
  int      radio_port;
  unsigned nopopsmtp;
  unsigned httpaccount;
  unsigned httpguestfirst;
  unsigned httpttypw;
  unsigned httpshowsysopcall;
  unsigned httprobots;
  unsigned unsecurettypw;
#ifdef INETMAILGATE
  char     internetmailgate[CALLEN+1];
#endif
#endif
#if defined __LINUX__ && defined _AX25K
  char     ax25k_if[80];
#endif
#ifndef __LINUX__
  int      summertime;
#endif
#ifdef __DOS16__
  int      pcisutc;
  int      stimeoffset;
#endif
  unsigned short paclen;
  int minpaclen;
  int maxpaclen;
  unsigned altboardinfo;
  unsigned mailbeacon;
  unsigned timeoutwarning;
  unsigned nounknownroute;
  unsigned asklogin;
  unsigned smoothheader;
#ifdef __LINUX__
  unsigned addlinuxsystemuser;
#endif
  unsigned fwdssid;
  unsigned callformat; //format amateur/cb/both
#ifdef _LCF //JJ
  unsigned logincallformat;
#endif
  unsigned savebroken; // save broken 7+files:
           // 0..do not save, 1..save if fbb-fwding, 2..always save it
  char     sysopcall[CALLEN+1];
#ifdef _GUEST
  char     guestcall[CALLEN+1];
#endif
  unsigned infolife;
  unsigned userlife;
  unsigned oldestfwd;
  unsigned oldestbeacon;
  char     userpath[FNAMELEN+1];
  char     infopath[FNAMELEN+1];
#ifdef FILESURF // DH3MB
  char     fspath[FSPATHLEN+1];
  unsigned fsbmail;
#endif
  char     m_filter[FNAMELEN+1];
  char     prompt[PROMPTLEN+1];
  char     sprache[4];
  char     firstcmd[FIRSTCMDLEN+1];
  char     mycall[4][CALLSSID+1];
  char     macro_mycall[MK_MYCALLS][CALLSSID+1];
  unsigned mycalls;
  unsigned macro_mycalls;
  unsigned helplevel;
  unsigned zeilen;
  unsigned deflf;
  unsigned short defstatus;
  unsigned short defhold;
#ifdef FBBCHECKREAD
  unsigned deffbbcheckmode;
#endif
  unsigned tracelevel;
  unsigned fwdtrace;
  unsigned tcpiptrace;
#ifdef HB9EAS_DEBUG
  unsigned hb9eas_debug;
#endif
  unsigned dosinput;
  unsigned autotrcwin;
  unsigned sysopbell;
  unsigned usvsense;
  unsigned watchdog;
  unsigned userquota;
  unsigned maxlogins;
  unsigned disable;
  unsigned sf_only;
  unsigned disable_user;        //no user-logins allowed
  unsigned scrolldelay;
  unsigned fwdtimeout;
  unsigned usrtimeout;
  unsigned holdtime;
  unsigned crtsave;
  unsigned timeslot;
  unsigned hadrstore;
  unsigned userpw;
  unsigned readlock;
  unsigned eraselog;
  unsigned remerase;
  unsigned createboard;         // 0: TMP wird erzeugt, keine Subboards
                                // 1: TMP wird erzeugt, Subboards
                                // 2: kein TMP, keine Subboards
  long     maxbids;             // max. nr of bids
  unsigned bidoffset;           // offset of bids (multiple bbs)
  bitfeld  opt[8];              // eg. fwd-options
  unsigned long maxusers;       // max. nr. of users
#ifdef _AUTOFWD
  unsigned autofwdtime; // hrx
#endif
  unsigned nopurge;
#ifdef MAILSERVER // DH3MB
  unsigned maillistserv;
  unsigned maillistsender;
#endif
#ifdef DF3VI_POCSAG
  unsigned pocsaglistserv;
#endif
  unsigned oldumail;
  unsigned defswaplf;
#ifdef _TELEPHONE
  unsigned ttydevice;
#endif
#ifdef _WXSTN
  wxdata_t wx;
  char wxstnname[31];
  long wxqthaltitude;    // absolute altitude of qth in meter
  long wxsensoraltitude; // relative altitude of sensor over ground
  char wxtty[21];
  char wxpath[30];
#endif
#ifdef _MORSED
  char cwid[50];        //CW station ID  eg = QST DE OE1XUR =
  long cwdoid;          //1 should send ID now, 0 else
  char cwnextjob[50];   //defines next job to do eg. TXFILE morse.txt
  long cwfreq;          //frequ. of cw-signal in hz. eg. 800
  long cwms;            //duration of a "dot" in ms
#endif
  unsigned tellmode;    //0..inactive, 1..send ok, 2..send/receive ok
  unsigned ltquery;
#ifdef _BCMNET_LOGIN
  int pwonly;
#endif
  int defrea;
  int defhttpsurface;
#if defined FEATURE_SERIAL || defined _TELEPHONE
  char ttymode[20]; // z.B. 1:9600,8,N,1,E or /dev/tty7
#endif
#ifdef _PREPOSTEXEC //db1ras
  char dospreexec[CMDBUFLEN];
  char dospostexec[CMDBUFLEN];
#endif
} mailpara_t;

/*---------------------------------------------------------------------------*/

typedef struct conv_t
{ struct conv_t *next;
  char line[100];
} conv_t;

/*---------------------------------------------------------------------------*/

typedef struct tvar_t : public task_t
{ char     logincall[CALLEN+1]; // Rufzeichen der eingelogten Station
  char     uplink[CALLSSID+1];  // erstes Digirufzeichen bzw. 'Console'
  char     via_radio;           // 1 = connection via radio (for maxlogin)
  char     downlink[CALLSSID+1];// letztes Digirufzeichen
  char     peerip[18];          // IP-Nummer
  char     mycall[CALLSSID+1];  // Connect-Rufzeichen ZUR Box
  int      semalock;            // Flag: File war gesperrt
  char     bereich;             // Flag fuer Bereich wurde angegeben
  bitfeld  optplus;             // gesetzte Optionen der Kommandozeile
  bitfeld  optminus;            // geloeschte Optionen
  int      optgroup;            // Index fuer Option (vom Befehl abhaengig)
  bitfeld  opt;                 // modifizierte Option (abh. Bef/Opt/U/I)
  char     line[BUFLEN];        // Mehrzweckpuffer
  long     txbytes;             // Zaehler fuer gesendete Daten
  long     rxbytes;             // Zaehler fuer empfangene Daten
  unsigned sentfiles;           // Zaehler fuer gesendete Files
  unsigned readfiles;           // Zaehler fuer gelesene Files
  int      linecount;           // Zaehler fuer Zeilenumbruch (Ausgabe)
  int      abbruch;             // Flag fuer Ausgabe-Stop
  int      quit;                // Flag fuer 1=logout 2=fast logout
  char     eingabefehler;       // counter for input-errors
  char     mailtype;            // type of mail: B(ulletin), P(ersonal), ...
  char     fwdhold;             // mail will not be forwarded automatically
                                // !..mail will be forwarded
                                // B..binary, partner does not support
                                // E..error, no bid (bulletin)
                                // F..deleted after forward, mail will not be forwarded again
                                // F..mail on hold if S&F without pwd (reject.bcm)
                                // H..general hold (reject.bcm)
                                // K..no BIN mails
                                // L..loop, fwd loop
                                // L..mail on hold if entered local (reject.bcm)
                                // M..no 7plus mails
                                // M..m_filter, no fwd (errorlevel 2)
                                // N..FBB_NO already rcvd, partner had mail before
                                // O..mail on hold if without ax25/tty-pwd (reject.bcm)
                                // P..mail on hold if without ax25-pwd (reject.bcm)
                                // R..FBB_REJECT
                                // S..size, mail too large
                                // X..set to hold by sysop
                                // Z..mail on hold if sent from a guest
  char     fwdprop;             // mail was proposed to the forward-partner
  char     replied;             // mail was replied
  char     conttype;            // contenttype of mail
                                // !..unknown
                                // 6..7plus with errors
                                // 6..7plus encoded file
                                // 8..7plus info-file
                                // 9..7plus text-file
                                // H..html-encoded mail
                                // B..AutoBIN
                                // D..Didadit
  char     eraseinfo,           // duplicate to geloescht
                                // '!'.. not erased
                                //  F..forwarded
                                //  E..user-erase
                                //  S..sysop-erase
                                //  W..server(WP,mail,tell)-erase
                                //  K..local remote-erase
                                //  L..remote-erased (bbs=orig.bbs)
                                //  X..remote-erased (bbs differ)
                                //  T..erase due to transfer
           flag7,flag8,
           flag9,flaga,flagb,flagc,
           flagd,flage,flagf,flag0; // further flags, reserved for future use
                                    // set to ! (default)
#if 0
  char     chatbuffer[100];     // Zeile fuer Mitteilungen von anderen
#else
  conv_t  *conv;
  int      convtable;
#endif
  char     sysop;               // Flag: Benutzer hat Sysoprechte
  char     pwok;                // Benutzer hat Userrechte (PW wie DPBOX)
  FILE     *inputfile;          // Filepointer, wenn Eingabe umgeleitet ist
  FILE     *outputfile;         // Filepointer, wenn Ausgabe umgeleitet ist
  FILE     *oldfile;            // Merker fuer Filepointer
  char     oldoldinput;         // Merker fuer Standardeingabemerker
  char     oldinput;            // Merker fuer Standardeingabe
  char     oldoutput;           // Merker fuer Standardausgabe
  char     continous;           // Flag: Ausgabe wird nicht angehalten
  time_t   logintime;           // Merker, wann der Login war
  int      privoffset;          // index in PRIV-File (fuer Forward-PWD)
#ifdef FEATURE_MDPW
  char     password[33];        // zuletzt aktives Passwort (fuer Fwd)
#else
  char     password[6];         // zuletzt aktives Password (fwd!)
#endif
  int      job;                 // Wird in User-Liste angezeigt

  char     prompt[30];          // Call/Boardname im Prompt
  char     mask[FNAMELEN+1];    // momentan aktive Dir-Maske (ende *.*)
  int      index;               // Index in Board-Tree (nur temporaer)
  char     mailpath[FNAMELEN+1];// Name der aktiven Mail mit Pfad
  char     mailfname[10];       // nur Filename (=Datum/Uhrzeit) der Mail
  char     listpath[FNAMELEN+1];// Name des akiven Listfiles mit Pfad
  char     boardpath[FNAMELEN+1]; // Dateipfad fuer Board (z.B. "info/soft/gp")
  char     boardname[10];       // Name des Boards ohne Pfad (z.B. "GP")
  char     boardfullname[FNAMELEN+1]; // Boardname komplett (z.B. "SOFT/GP")
  char     ziel[DIRLEN+1];      // evtl unvollst. Ziel nach SEND
  char     zielboard[DIRLEN+1]; // DH3MB: Board nach convert.bcm
  char     herkunft[CALLEN+1];  // Call des Verfassers der Mail
  char     frombox[CALLEN+1];   // Box, von der WIR die Mail bekommen haben
  char     at[HADRESSLEN+1];    // vollstaendige H-Adresse der Nachricht
  char     bid[BIDLEN+1];       // BID der letzten Nachricht, evtl neu
  long     binstart;            // Position des BIN-Teils in der Mail-Datei
  char     destboxlist[DESTBOXLEN+1];   // Forward-Liste der Nachricht
  char     usermail;            // Nachricht ist User-Nachricht
  char     gelesen;             // Nachricht ist schon gelesen
  char     geloescht;           // Nachricht ist geloescht
  int      lifetime;            // Lifetime (insgesamt, nicht aktuell)
  unsigned lines;               // Anzahl Zeilen der letzten Nachricht
  long     bytes;               // Anzahl Bytes der letzten Nachricht
  char     betreff[BETREFFLEN+1]; // Titel der Nachricht
  time_t   abwann;              // Zeitangabe fuer DIR AFTER etc.
  unsigned long beginn;         // Bereich fuer DIR READ ERASE CHECK
  unsigned long ende;           // Bereich fuer DIR READ ERASE CHECK
  char     replyboard[10];      // Boardname der zuletzt gelesenen Nachricht
  unsigned replynum;            // Nummer der zuletzt gelesenen Nachricht
  char     tmpbid[5][BIDLEN+1]; // Momentan empfangene BIDs
  int      boardlife_max;       // momentan aktive maximale Lifetime
  int      boardlife_min;       // momentan aktive minimale Lifetime
  int      msg_loadnum;         // "magic number" fuer geladene MSG-Version
  int      msg_offset;
  time_t   lastdirnews;         // exakter Zeitpunkt des D N (Check)
  fwdtype_t forwarding;         // fwd_none, fwd_standard, fwd_user
  void    *fwd_parameter;       // ggf. Zeiger auf fpara-struktur
  char     boxtyp;              // Software, die beim Partner rennt
  char     boxversion;          // Version der Forwardpartner-Box
  void    *script_p;
  char    *inbuffer;
  int      inbindex;
  int      inbmax;
  char    *outbuffer;
  int      outbindex;
  int      outbmax;
  int      http;
  int      ftp;
  unsigned charset;
  jmp_buf  io_mem_jmp;
  user_t   u;                   // USER-Struktur fuer eingeloggten User
#ifdef __FLAT__
  int      headermode;
#endif
#ifdef FILESURF // DH3MB
  char     fspath[100];
  char     fsmode;
#endif
  unsigned long fbboffset; // DH3MB
  char     pacbytes;            // like txbytes but one packet only
#ifdef _BCMNET_LOGIN
  char     logintype;           // hpk: Is the call a normal user or a guest?
                                //      0 ... guest / 1 ... normal
#endif
} tvar_t;

/*---------------------------------------------------------------------------*/

#define WPROT_MIN_ROUTING   32767

typedef struct fwdpara_t
{
  char    call[CALLEN+1];       // Rufzeichen der Nachbarbox
  char    concall[FSPATHLEN];   // Connect-Rufzeichen der Nachbarbox
  char    times[25];            // Bytefeld fuer die Uhrzeiten
  long    maxbytes;             // maximale Anzahl pro geforwardetes File
  bitfeld options;              // eingestellte Optionen
  char    connectbar;           // war beim letzten Versuch erreichbar
  int     nolink;               // Zaehler wie oft hintereinander kein Link moeglich war
  time_t  lastconok;            // Zeitpunkt letzter i.O.-Connect
  time_t  lastlogin;            // Zeitpunkt letzter eingehender Connect
  time_t  lastwp;               // Zeitpunkt letzter WPROT-Update
  time_t  sidrtt;
  long    timeout_cnt;          // number of timeouts
  long    n_conok;              // number of outgoing connects
  long    n_login;              // number of incoming connects
  long    txf;                  // number of files sent
  long    rxf;                  // number of files received
  char    ssid;
  char    newmail;
  char    mid;
  char    u_onlydelay;
  char    i_onlydelay;
  int     fwdcallformat;        // callformat allowed for forwarding

  // WPROT routing
  int     wprot_r_partner;      // Fwd-Partner versteht WPROT R-Zeilen
  time_t  lastmeasure;          // Zeitpunkt letzte WPROT-R-Line-Messung
  time_t  lastwpr;              // Zeitpunkt letzter WPROT-R-Line-Update
  long    routing_quality;      // Quality der letzten 5 Stunden
  long    routing_txf;          // number of files sent since last WPROT
//  short   routing_hops;         // Hops der letzten 5 Stunden
  long    current_routing_quality; // Quality der letzten Messung
//  short   current_routing_hops;    // Hops der letzten Messung
//  char    routing_neighbour[CALLEN+1];  // Routing ueber diese Partnerbox

} fwdpara_t;

/*---------------------------------------------------------------------------*/

typedef struct wpdata_t
{
  char   call[CALLEN+1];
  char   bid[BIDLEN+1];
  char   bbs[HADRESSLEN+1];
  char   logincall[CALLEN+1];
  char   origin[CALLEN+1];
  char   name[NAMELEN+1];
  char   zip[ZIPLEN+1];
  char   qth[QTHLEN+1];
  char   hadr[HADRESSLEN+1];
  char   bstatus[BSTATUSLEN+1];
  char   sysopcall[CALLEN+1];
  char   protocol[BPROTOLEN+1];
  char   hwaddress[BHWADDRESSLEN+1];
  time_t mybbstime;
  short  hops;
  long   qual;
  long   bversion;
} wpdata_t;

/*---------------------------------------------------------------------------*/

typedef enum boxkind_t
{ b_baycom,
  b_dxl,
  b_thebox,
  b_fbb,
  b_rli,
  b_mbl,
  b_dp,
  b_wgt,
  b_unknown
} boxkind_t;

/*---------------------------------------------------------------------------*/

typedef enum mail_modify_t
{ w_erase,
  w_unerase,
  w_forward,
  w_transfer,
  w_setlifetime,
  w_reply,
  w_comment,
#ifdef DF3VI_EXTRACT
  w_extract, //extract-funktion
#endif
  w_unread,  //unread-funktion (Ruecksetzen des gelesen-flags)
  w_hold
} mail_modify_t;

/*---------------------------------------------------------------------------*/

typedef enum
{ unbekannt,
  bekannt,
  bleibtliegen,
  auto_bekannt,
  active_bekannt
} fwd_weiter_t;

/*---------------------------------------------------------------------------*/

typedef enum
{ sh_noinput,
  sh_forceinput,
  sh_ifmultitask,
  sh_interactive
} shellinput_t;

/*---------------------------------------------------------------------------*/

typedef struct hadr_t
{
  long   bulletins;                  // 4
  long   usermails;                  // 4
  time_t delay[ADJNUM];              // 80
  time_t lastupdate[ADJNUM];         // 80
  time_t lasthtime;                  // 4 latest header-update scanned (mail)
  time_t lastwprcvd;                 // 4 latest wp-update received
  time_t lastwpsend;                 // 4 latest wp-update sent
  long   bversion;                   // 4
  time_t r_time_rx;                  // 4
  time_t r_time_tx;                  // 4
  time_t reserved_t[22];             // 88
  short  int rel_mails[ADJNUM];      // 40
  short  int hops[ADJNUM];           // 40
  short  unsigned nextsamehash;      // 2
  short  reserved_s[25];             // 50
  char   adr[HADRESSLEN+1];          // 40
  char   adjacent[ADJNUM][7];        // 140
  char   lastheader[HEADERLEN+1];    // 61
  char   lastbid[BIDLEN+1];          // 13
  char   lastboard[DIRLEN+1];        // 9
  char   lastuser[CALLEN+1];         // 7
  char   bstatus[BSTATUSLEN+1];      // 21
  char   sysopcall[CALLEN+1];        // 7
  char   protocol[BPROTOLEN+1];      // 11
  char   hwaddress[BHWADDRESSLEN+1]; // 50
  char   r_from[CALLEN+1];           // 7
  short  r_hops;                     // 2
  long unsigned r_qual_rx;           // 4
  char   reserved[240];              // 240
  } hadr_t;                          // = 1024 Bytes

/*---------------------------------------------------------------------------*/

#define ADJOLDNUM 5

#ifdef __MSDOS__
typedef struct hadrold_t
{ char   adr[HADRESSLEN+1];           // 40
  char   adjacent[ADJOLDNUM][7];      // 35
  short  int rel_mails[ADJOLDNUM];    // 10
  time_t delay[ADJOLDNUM];            // 20
  time_t lastupdate[ADJOLDNUM];       // 20
  short  int hops[ADJOLDNUM];         // 10
  long   bulletins;                   // 4
  long   usermails;                   // 4
  time_t lasthtime;                   // 4
  char   lastheader[HEADERLEN+1];     // 61
  char   lastbid[BIDLEN+1];           // 13
  char   lastboard[9];                // 9
  char   lastuser[7];                 // 7
  char   reserved[17];                // 51
  short unsigned nextsamehash;        // 2
} hadrold_t;
#else
typedef struct hadrold_t              // 290
{
  long   bulletins;                   // 4
  long   usermails;                   // 4
  time_t delay[ADJOLDNUM];            // 20
  time_t lastupdate[ADJOLDNUM];       // 20
  time_t lasthtime;                   // 4
  short  int rel_mails[ADJOLDNUM];    // 10
  short  int hops[ADJOLDNUM];         // 10
  short  unsigned nextsamehash;       // 2
  char   adr[HADRESSLEN+1];           // 40
  char   adjacent[ADJOLDNUM][7];      // 35
  char   lastheader[HEADERLEN+1];     // 61
  char   lastbid[BIDLEN+1];           // 13
  char   lastboard[9];                // 9
  char   lastuser[7];                 // 7
  char   reserved[17];                // 51
} hadrold_t;
#endif

/*---------------------------------------------------------------------------*/

typedef enum
{ m_sendnotpossible,    // send.cpp
  m_boardnotpossible,   // read.cpp, send.cpp
  m_messagenotforward,
  m_forwardunknown,
  m_title,
  m_textinput,
  m_textsend,
  m_linesfor,
  m_stored,
  m_msgarrived,
  m_nomessagestored,
  m_bidexists,
  m_address,
  m_fwdunknown,
  m_isknown,
  m_isadjacent,         // obsolete
  m_noforwarding,
  m_syntaxpath,
  m_adrunknown,         // read.cpp, tell.cpp, ping.cpp
  m_givenumber,
  m_erased,
  m_unerased,
  m_forwarded,
  m_syntaxforward,
  m_lifetimeset,
  m_syntaxlifetime,
  m_tr_ok,              // read.cpp
  m_tr_syntax,          // read.cpp
  m_permissiondenied,
  m_messagewillbe,
  m_messageswillbe,
  m_nomessagefound,     // read.cpp
  m_erasemessage,
  m_messageerased,
  m_messageiserased,
  m_noboxfound,         // dir.cpp
  m_dirofusers,
  m_dirofbulletins,
